KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
            printTFTText(getTimeHMS(timerRed.Secs()), teamTimerPositionX, redTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            printTFTText(getTimeHMS(timerBlue.Secs()), teamTimerPositionX, blueTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

            game_timer.Start();
            st++;
            break;

        case 1:
            // перерисовали статический вид
            RenderStaticView();
            // переходим сразу к обработке кнопок (если кнопка уже удерживается, обработаем её без второго клика)
            st = 2;
            break;

        case 2:
        static uint32_t pressStart = 0;
        static uint32_t HOLD_THRESHOLD_MS = 80;  // можно уменьшить до 50–30 мс

        if (!arming.active) {
            bool redPressed  = isButtonPressed(&redButton);
            bool bluePressed = isButtonPressed(&blueButton);

            if (redPressed || bluePressed) {
                // ==== Первый кадр после нажатия — сразу шлём событие на ленту ====
                if (pressStart == 0) {
                    pressStart = xTaskGetTickCount();

                    // Сразу включаем индикацию на ленте (даже до полного удержания)
                    ledMsg.cmd = (G_u8Team == NOONE) ? START_ARMING : START_DISARMING;
                    ledMsg.data[0] = 2;
                    ledMsg.data[1] = (G_u8Team == NOONE) ? (redPressed ? RED : BLUE) : G_u8Team;
                    if (!q_out_msg.push(&ledMsg)) log_e("q_out_msg full");
                }

                // ==== Проверяем, прошло ли нужное время удержания ====
                uint32_t elapsed = (xTaskGetTickCount() - pressStart) * portTICK_PERIOD_MS;
                if (elapsed >= HOLD_THRESHOLD_MS) {
                    // Удержание подтверждено — начинаем настоящий арминг/дизарминг
                    progressRed = progressBlue = 0;

                    if (redPressed) {
                        arming.progress  = &progressRed;
                        arming.timePress = &time_press_red;
                        arming.button    = &redButton;
                        arming.team      = RED;
                    } else {
                        arming.progress  = &progressBlue;
                        arming.timePress = &time_press_blue;
                        arming.button    = &blueButton;
                        arming.team      = BLUE;
                    }

                    *arming.timePress = xTaskGetTickCount();
                    arming.active = true;

                    printTFTText(G_u8Team == NOONE ? "      ARMING      " : "      DISARMING      ",
                                NO_X, PADDING, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

                    outMsg.cmd = PLAY_TRACK;
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = (G_u8Team == NOONE) ? MP3_CAP_POINT : MP3_CAP_OUR_POINT;
                    if (!q_out_msg.push(&outMsg)) log_e("q_out_msg full");

                    st = 3;  // переходим к прогресс-бару
                }
            } 
            else {
                // Кнопки отпущены — сбрасываем таймер удержания
                pressStart = 0;
            }
        }
        break;

        case 3:
            if (arming.active) {
                // Обновляем прогресс
                uint32_t elapsed = (xTaskGetTickCount() - *arming.timePress) * portTICK_PERIOD_MS;
                *arming.progress = map(elapsed, 0, G_u32ActivationTimeMS, 0, MAX_PROGRESS);
                *arming.progress = min(*arming.progress, (uint8_t)MAX_PROGRESS);

                // Безопасный tone() один раз на каждые 50 мс
                static uint32_t lastToneTime = 0;
                if (millis() - lastToneTime >= 50) {
                    tone(BUZZER_PIN, (*arming.progress) * 25);
                    lastToneTime = millis();
                }

                tft.fillRect(PROGRESS_BAR_X_POSITION, PROGRESS_BAR_Y_POSITION,
                             map(*arming.progress, 0, MAX_PROGRESS, 0, PROGRESS_BAR_WIDTH),
                             PROGRESS_BAR_HEIGHT, TFT_WHITE);

                // Завершение арминга
                if (*arming.progress >= MAX_PROGRESS) {
                    log_i("Progress is 100");
                    clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
                    *arming.progress = MAX_PROGRESS;
                    st = 4;
                    arming.active = false;
                }

                // Если кнопку отпустили
                if (!isButtonPressed(arming.button)) {
                    log_i("Button released");
                    *arming.progress = 0;
                    clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
                    arming.active = false;
                    st = 1;

                    ledMsg.cmd = WAITING;
                    ledMsg.data[0] = 2;
                    ledMsg.data[1] = G_u8Team;
                    if (!q_out_msg.push(&ledMsg)) log_e("Error: q_out_msg is full");
                }
            }
            break;

        case 4:
            // Точка захвачена
            if (G_u8Team == NOONE) {
                if (progressRed >= MAX_PROGRESS) {
                    timerRed.Start();
                    timerBlue.Stop();
                    G_u8Team = RED;
                    log_d("red team timer started. team is RED");
                } else if (progressBlue >= MAX_PROGRESS) {
                    timerBlue.Start();
                    timerRed.Stop();
                    G_u8Team = BLUE;
                    log_d("blue team timer started. team is BLUE");
                }

                outMsg.cmd = PLAY_TRACK;
                outMsg.data[0] = G_u8Team - 1;
                outMsg.data[1] = MP3_WE_CAP_POINT;
                if (!q_out_msg.push(&outMsg)) log_e("Error: q_out_msg is full");

                outMsg.data[0] = G_u8Team == RED ? BLUE - 1 : RED - 1;
                outMsg.data[1] = MP3_ENEMY_CAP_POINT;
                if (!q_out_msg.push(&outMsg)) log_e("Error: q_out_msg is full");

            } else {
                timerRed.Stop();
                timerBlue.Stop();
                outMsg.data[0] = G_u8Team - 1;
                outMsg.data[1] = MP3_WE_LOST_POINT;
                outMsg.cmd = PLAY_TRACK;
                if (!q_out_msg.push(&outMsg)) log_e("Error: q_out_msg is full");
                G_u8Team = NOONE;
            }

            ledMsg.cmd = WAITING;
            ledMsg.data[1] = G_u8Team;
            if (!q_out_msg.push(&ledMsg)) log_e("Error: q_out_msg is full");

            RenderStaticView();
            st = 5;
            break;

        case 5:
            // Ждем отпускания обеих кнопок
            if (!isButtonPressed(&redButton) && !isButtonPressed(&blueButton)) {
                st = 1;
                ledMsg.cmd = WAITING;
                ledMsg.data[1] = G_u8Team;
                if (!q_out_msg.push(&ledMsg)) log_e("Error: q_out_msg is full");
            }
            break;

