KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
        case 4:                                             // ожидание завершения активации/деактивации
            if (redValue >= 100 || blueValue >= 100) {      // если активация/деактивация завершена
                if (G_u8Team == NOONE) {                    // если активация завершена
                    G_u8Team = redValue >= 100 ? RED : BLUE;
                    //lcd.setCursor(3, 2);
                    //lcd.print(team_names[G_u8Team]);
                    //lcd.print(F(" activated"));
					printTFTText((String)team_names[G_u8Team]+" activated", NO_X, HEADER_SPACE_H, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    // Проигрываем на базе команды, которая не активировала бомву
                    outMsg.data[0] = G_u8Team == RED ? BLUE - 1 : RED - 1;
                    outMsg.data[1] = MP3_STOP_BOMB;
                    game_timer.Start();                 // запускаем таймер игры
                    //lcd.setCursor(0, 3);
                    //lcd.print(F("Bomb time:  "));
					printTFTText("Bomb time:  ", 0, HEADER_SPACE_H*3, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    bomb_timer.Start();
                    start_bomb_time = xTaskGetTickCount();
                    activated = true;
                }
                else {                                          // если деактивация завершена
                    bomb_timer.Stop();
                    activated = false;
                    //lcd.setCursor(0, 2);
                    //lcd.print("                    ");
					clearSpace(0, HEADER_SPACE_H*2, DISPLAY_WIDTH, HEADER_SPACE_H, TFT_BLACK);
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_DEACTIVATED_BOMB;
                    *winner = G_u8Team == RED ? BLUE : RED;  // запоминаем победителя
                    G_u8Team = NOONE;
                }

                outMsg.cmd = PLAY_TRACK;
                if (!q_out_msg.push(&outMsg))
                    log_e("Error: q_out_msg is full");

                // RenderStaticView();
                st++;                                           // устройство активировано/деактивировано
            }
            else if (!redValue && !blueValue) {                  // отпуcтили кнопку раньше ArmTime
                // redValue = ProcessButton(redButton, &progressRed, &time_press_red);
                // blueValue = ProcessButton(blueButton, &progressBlue, &time_press_blue);
                noTone(BUZZER_PIN);
                st = 1;                                         // авторизация сохраняется
            }
            break;

        case 5:  // ждем отжатия обоих кнопок
            if (!redValue && !blueValue) {
                pass_ok = false;        // для последующих активации/деактивации снова потребуется ввод пароля
                st = 1;
            }
            break;

        case 6:  // если время игры истекло или таймер заряда обнулился
            if (bomb_timer.GetTime() == 0 && activated && G_u8Team != NOONE)
                *winner = (team_t) G_u8Team;
            else
                *winner = NOONE;
            st++;
            break;

        case 7:     // ожидание завершения передачи сообщений
            if (fEmpty) {
                st = 0;
                return true;
            }
            break;

    } // switch

    fEmpty = sendESP_NOW();

    if (game_timer.isRunning()) {
        game_timer.Tick();
        // if (u8BombState == BS_RUN)
        if (activated)
            bomb_timer.Tick();

        // Если время игры истекло или таймер заряда обнулился
        if (!game_timer.GetTime() || !bomb_timer.GetTime()) {
            game_timer.Stop();
            bomb_timer.Stop();
            //lcd.setCursor(12, 1);
			clearSpace(timerPositionX, HEADER_SPACE_H, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
            //showTimeHMS(lcd, 0);
			printTFTText((String)getTimeHMS(0), timerPositionX, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            //lcd.setCursor(12, 3);
			clearSpace(timerPositionX, HEADER_SPACE_H*3, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
            //showTimeHMS(lcd, bomb_timer.Secs());
			printTFTText((String)getTimeHMS(bomb_timer.Secs()), timerPositionX, HEADER_SPACE_H*3, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            st = 6;
        }
        else if (st != 4) {
            if (game_timer.Secs() != secs) {
                //lcd.setCursor(12, 1);
				clearSpace(timerPositionX, HEADER_SPACE_H, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
                secs = game_timer.Secs();
                //showTimeHMS(lcd, secs);
				printTFTText((String)getTimeHMS(secs), timerPositionX, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

                // if (u8BombState == BS_RUN) {
                if (activated) {
                    //lcd.setCursor(12, 3);
					clearSpace(timerPositionX, HEADER_SPACE_H*3, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
                    //showTimeHMS(lcd, bomb_timer.Secs());
					printTFTText((String)getTimeHMS(bomb_timer.Secs()), timerPositionX, HEADER_SPACE_H*3, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                }

                tone(BUZZER_PIN, BUZZER_FREQUENCY, BUZZER_DURATION);
                fCursorChange = true;
            }

            if (i8CheckTimeCount) {
                if (secs <= arTimeMikers[i8CheckTimeCount - 1]) {
                    outMsg.cmd = PLAY_TRACK;
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_MISSION_END_10S + i8CheckTimeCount - 1;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    i8CheckTimeCount--;
                }
            }

            if (i8CheckBombTimeCount) {
                if (xTaskGetTickCount() - start_bomb_time <= arBombTimeMikers[i8CheckBombTimeCount - 1]) {
                    outMsg.cmd = PLAY_TRACK;
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_STOP_BOMB_3M + i8CheckBombTimeCount - 1;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    i8CheckBombTimeCount--;
                }
            }

