KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
        }
    }
    return false;
}


// bool Bomb(ListParameter* params, team_t* winner) {
    //----------------------------------------------------------------------------+
    // При старте игры таймер игры остановлен и дисплей погашен.                  |
    // При первом нажатии кнопки на клавиатуре, дисплей включается и на экране    |
    // появляется приглашение для ввода пароля. Игрок вводит пароль и если он     |
    // верный - разрешается активация заряда нажатием любой из кнопок. После      |
    // активации запускается таймер игры и таймер отсчета времени до конца заряда.|
    // Также высвечивается команда, активировавшая заряд. Заряд можно деактивиро- |
    // вать, но потребуется ввод пароля. Игра продолжается до обнуления таймера   |
    // заряда или таймера игры. Побеждпет команда, обнулившая таймер заряда.      |
    //----------------------------------------------------------------------------+
    /*
     01234567890123456789 01234567890123456789 01234567890123456789
    +--------------------+--------------------+--------------------+--------------------+
    |      BOMB MODE     |Enter PASS> ********|        ARMING      |      BOMB MODE     |
    |GAME TIME   00:15:20|GAME TIME   00:15:20|***************     |GAME TIME   00:15:04|
    |                    |   BLUE activated   |                    |   BLUE activated   |
    |                    |BOMB TIME   00:01:59|                    |BOMB TIME   00:01:59|
    +--------------------+--------------------+--------------------+--------------------+*/



    /*
    static uint8_t st = 0;
    static uint32_t secs = 0;
    static uint32_t time_press_red = xTaskGetTickCount();
    static uint32_t time_press_blue = xTaskGetTickCount();
    static uint8_t progressRed = 0;
    static uint8_t progressBlue = 0;
    uint8_t redValue, blueValue;

    static bool fEmpty = true;
    static int8_t i8CheckTimeCount;
    static bool fCursorChange = true;
    espnow_msg_t outMsg;

    // static uint8_t u8BombState;
    static bool activated = false;
    static bool pass_ok;                          // true-авторизация выполнена

    redButton.read();
    blueButton.read();

    if (pass_ok && (st > 2 && st < 6)) {
        redValue = ProcessButton(redButton, &progressRed, &time_press_red);
        blueValue = ProcessButton(blueButton, &progressBlue, &time_press_blue);
    }

    switch (st) {
        case 0:                                   // инициализация переменных, отрисовка статической информации на дисплее
            G_u8Team = NOONE;
            pass_ok = false;
            i8CheckTimeCount = getTimeMarker(secs);
            lcd.clear();
            game_timer.SetTime(G_u32GameTimeMS);  // устанавливаем таймер игры
            // secs = 0;
            secs = game_timer.Secs();
            i8CheckTimeCount = getTimeMarker(secs);
            bomb_timer.SetTime(G_u32BombTimeMS);  // устанавливаем таймер бомбы
            // u8BombState = BS_IDLE;
            activated = false;
            st++;
            break;

        case 1:    // отрисовка команды-владельца gamepad
            RenderStaticView();
            st++;
            break;

        case 2:    // ожидание авторизации
            if (!pass_ok) {
                pass_ok = enterPassword(&fCursorChange);
            }
            else
                st++;
            break;

        case 3:    // ожидание старта активации/деактивации
            if (redValue || blueValue) {
                lcd.setCursor(0, 0);
                if (G_u8Team == NOONE) {
                    lcd.print(F("        ARMING      "));
                    // Проигрываем на базе команды, которая не захватывает точку
                    outMsg.data[0] = redValue ? BLUE - 1 : RED - 1;
                    outMsg.data[1] = MP3_THEY_ACTIVATE_BOMB;
                    outMsg.cmd = PLAY_TRACK;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    }
                else {
                    lcd.print(F("      DISARMING     "));
                    // Проигрываем на базе команды, которая не деактивирует точку
                    // outMsg.data[0] = G_u8Team - 1;
                    // outMsg.data[1] = MP3_CAP_OUR_POINT;
                }

                st++;
            }
            break;

        case 4:                                             // ожидание завершения активации/деактивации
            if (redValue >= 100 || blueValue >= 100) {      // если активация/деактивация завершена
                if (G_u8Team == NOONE) {                    // если активация завершена
                    G_u8Team = redValue >= 100 ? RED : BLUE;
                    lcd.setCursor(3, 2);
                    lcd.print(team_names[G_u8Team]);
                    lcd.print(F(" activated"));
                    // Проигрываем на базе команды, которая не активировала бомву
                    outMsg.data[0] = G_u8Team == RED ? BLUE - 1 : RED - 1;
                    outMsg.data[1] = MP3_STOP_BOMB;
                    // if (u8BombState == BS_IDLE) {           // если первая активация
                        game_timer.Start();                 // запускаем таймер игры
                        lcd.setCursor(0, 3);
                        lcd.print(F("BOMB TIME   "));
                        // "BOMB TIME   00:01:59"
                    // }
                    bomb_timer.Start();
                    // u8BombState = BS_RUN;
                    activated = true;
                }
                else {                                          // если деактивация завершена
                    bomb_timer.Stop();
                    // u8BombState = BS_STOP;
                    activated = false;
                    lcd.setCursor(0, 2);
                    lcd.print("                    ");
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_DEACTIVATED_BOMB;
                    G_u8Team = NOONE;
                }

                // outMsg.cmd = PLAY_TRACK;
                // if (!q_out_msg.push(&outMsg))
                //     log_e("Error: q_out_msg is full");

                // RenderStaticView();
                st++;                                           // устройство активировано/деактивировано
            }
            else if (!redValue && !blueValue)                   // отпуcтили кнопку раньше ArmTime
                st = 1;                                         // авторизация сохраняется
            break;

        case 5:  // ждем отжатия обоих кнопок
            if (!redValue && !blueValue) {
                pass_ok = false;        // для последующих активации/деактивации снова потребуется ввод пароля
                st = 1;
            }
            break;

        case 6:  // если время игры истекло или таймер заряда обнулился
            // if (bomb_timer.GetTime() == 0 && u8BombState == BS_RUN && G_u8Team != NOONE)
            if (bomb_timer.GetTime() == 0 && activated && G_u8Team != NOONE)
                *winner = (team_t) G_u8Team;
            else
                *winner = NOONE;
            st++;
            break;

        case 7:     // ожидание завершения передачи сообщений
            if (fEmpty) {
                st = 0;
                return true;
            }
            break;

    } // switch

