KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
        case 2:                                   // время игры истекло
            if (points[RED - 1] == points[BLUE - 1])
                *winner = NOONE;
            else
                *winner = points[RED - 1] > points[BLUE - 1] ? RED : BLUE;

            //digitalWrite(RED_LED_PIN, *winner == RED ? LED_ON : LED_OFF);
            //digitalWrite(BLUE_LED_PIN, *winner == BLUE ? LED_ON : LED_OFF);
            st++;
            break;

        case 3:     // ожидание завершения передачи сообщений
            if (fEmpty) {
                st = 0;
                return true;
            }
            break;

    } // switch

    fEmpty = sendESP_NOW();

    if (game_timer.isRunning()) {
        game_timer.Tick();
        // Если время игры истекло
        if (!game_timer.GetTime()) {
            game_timer.Stop();
            //lcd.setCursor(12, 1);
			clearSpace(timerPositionX, HEADER_SPACE_H, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
            //showTimeHMS(lcd, 0);
			printTFTText(getTimeHMS(0), timerPositionX, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            st = 2;
        }
        else if (game_timer.Secs() != secs) {
            //lcd.setCursor(12, 1);
			clearSpace(timerPositionX, HEADER_SPACE_H, DISPLAY_WIDTH-timerPositionX, HEADER_SPACE_H, TFT_BLACK);
            secs = game_timer.Secs();
            //showTimeHMS(lcd, secs);
			printTFTText(getTimeHMS(secs), timerPositionX, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            tone(BUZZER_PIN, BUZZER_FREQUENCY, BUZZER_DURATION);

            if (i8CheckTimeCount) {
                if (secs <= arTimeMikers[i8CheckTimeCount - 1]) {
                    outMsg.cmd = PLAY_TRACK;
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_MISSION_END_10S + i8CheckTimeCount - 1;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    i8CheckTimeCount--;
                }
            }
        }
    }

    return false;
}


void showWinerTeam(team_t winner) {
    // индикация победителя
    switch (G_u8GameMode) {
        case DOMIN:
			clearScreen();
            //lcd.setCursor(6, 1);
            if (winner == NOONE) {
                //lcd.print(F("  DRAW!     "));
				printTFTText("DRAW!", NO_X, HEADER_SPACE_H, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            }
            else {
                //lcd.print(team_names[winner]);
                //lcd.print(F(" WIN!   "));
				printTFTText((String)team_names[winner]+" WIN!", NO_X, HEADER_SPACE_H, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            }
            // гасим возможную стрелочку
			//
			// я хз что за стрелка, но если она будет, то надо ее убарить с помощью clearSpace
			//
            //lcd.setCursor(5, 2);
            //lcd.print(F("     "));
            //lcd.setCursor(5, 3);
            //lcd.print(F("     "));
            break;
        case DOMIN_PRO:
            break;
        case BOMB:
        case CTRL_POINT:
            //lcd.setCursor(0, 1);
			clearSpace(0, HEADER_SPACE_H, DISPLAY_WIDTH, HEADER_SPACE_H, TFT_BLACK);
            if (winner == NOONE)
                            //01234567890123456789
                //lcd.print(F("         DRAW !      "));
				printTFTText("DRAW !", NO_X, HEADER_SPACE_H, CENTER_BY_X, CENTER_BY_Y, HEADER_FONT);
            else if (winner == RED)
                //lcd.print(F("       RED WIN!      "));
				printTFTText("RED WIN!", NO_X, HEADER_SPACE_H, CENTER_BY_X, CENTER_BY_Y, HEADER_FONT);
            else
                //lcd.print(F("       BLUE WIN!     "));
				printTFTText("BLUE WIN!", NO_X, HEADER_SPACE_H, CENTER_BY_X, CENTER_BY_Y, HEADER_FONT);
            break;
    }
}


bool GameOver(team_t winner) {
    /*  Индикация результата игры
     01234567890123456789 01234567890123456789
    +--------------------+--------------------+
    |     GAME OVER !    |Press # for new game|
    |     BLUE WIN !     |     BLUE WIN !     |
    |                    |                    |
    |                    |                    |
    +--------------------+--------------------+
    */
    static uint8_t st = 0;
    static uint32_t tm;
    static bool xFlash;
    uint32_t rv;
    static bool fEmpty = true;
    espnow_msg_t outMsg;

    switch (st) {
        case 0:
            xFlash = false;
            tm = 0;
            showWinerTeam(winner);
            outMsg.cmd = PLAY_TRACK;
            outMsg.data[0] = BROADCAST;
            if (winner == NOONE)
                outMsg.data[1] = MP3_NO_WIN;
            else
                outMsg.data[1] = winner == RED ? MP3_RED_WIN : MP3_BLUE_WIN;
            if (!q_out_msg.push(&outMsg))
                log_e("Error: q_out_msg is full");
            st++;
            break;

        case 1:         // ждем завершения передачи, затем отключаем WiFi
            if (fEmpty) {
                xTaskNotify(hTaskWiFi, NTF_STOP_WIFI, eSetBits);
                st++;
            }
            break;

        case 2:         // ждем уведомления об отключении WiFi
            if (xTaskNotifyWait(0, NTF_STOP_WIFI, &rv, 0) == pdTRUE) {
                log_i("WiFi отключена");
                st++;
            }
            break;

        case 3:       // мигание сообщения в строке 1 и ожидание нажатия перезапуска
            if (kpd.getKey() == '#') {
                st = 0;
                return true;
            }
            if (xTaskGetTickCount() - tm > 1500) {
                //lcd.setCursor(0, 0);
                clearSpace(0, 0, DISPLAY_WIDTH, HEADER_SPACE_H, TFT_BLACK);
                if (!xFlash)
                    //lcd.print(F("     GAME OVER !    "));
					printTFTText("GAME OVER !", NO_X, 0, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                else
                    //lcd.print(F("Press # for new game"));
					printTFTText("Press # for new game", NO_X, HEADER_SPACE_H, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                tm = xTaskGetTickCount();
                xFlash = !xFlash;
            }
            break;
    }

    if (st < 2) fEmpty = sendESP_NOW();

    return false;
}

#endif
